#+TITLE: Multiples of 3 or 5
#+AUTHOR: 8dcc
#+OPTIONS: toc:2
#+STARTUP: nofold
#+PROPERTY: header-args:C      :tangle multiples.c
#+PROPERTY: header-args:scheme :tangle multiples.scm

* Problem

If we list all the natural numbers below 10 that are multiples of 3 or 5, we get
3, 5, 6 and 9. The sum of these multiples is 23.

Find the sum of all the multiples of 3 or 5 below 1000.

* C code

#+begin_src C
#include <stdbool.h>
#include <stdio.h>

bool valid_num(int n) {
    return n % 3 == 0 || n % 5 == 0;
}

int main(void) {
    int result = 0;

    for (int i = 0; i < 1000; i++)
        if (valid_num(i))
            result += i;

    printf("Result: %d\n", result);

    return 0;
}
#+end_src

#+RESULTS:
: Result: 233168

* Scheme code

#+begin_src scheme
(define (valid-num? x)
  (or (zero? (modulo x 3))
      (zero? (modulo x 5))))

(define (calculate-multiples n)
  (cond ((zero? n)      0)
        ((valid-num? n) (+ n (calculate-multiples (- n 1))))
        (else           (calculate-multiples (- n 1)))))

(calculate-multiples 999)
#+end_src

#+RESULTS:
: 233168
